yingshaoxo/super_led_fan/MSP430F169/main.c
#pragma vector = TIMER0_B0_VECTOR
__interrupt void Timer_B(void) {
    // don't know why this have to be exist, but without it, TBR won't work
}

// ***************
// ****************
// Control the LEDs !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// data: P5.0-P5.7
// enable: P6.0-P6.3
//
// ***************
// ****************

#define enable_upper_red_chip P6OUT |= BIT3
#define disable_upper_red_chip P6OUT &= ~BIT3

#define enable_upper_green_chip P6OUT |= BIT1
#define disable_upper_green_chip P6OUT &= ~BIT1

#define enable_lower_red_chip P6OUT |= BIT2
#define disable_lower_red_chip P6OUT &= ~BIT2

#define enable_lower_green_chip P6OUT |= BIT0
#define disable_lower_green_chip P6OUT &= ~BIT0

unsigned char int_to_led_hex(int number) {
    if (number > 8) {
        number = number - 8;
    }
    switch (number) {
    case 1:
        return 0x01;
    case 2:
        return 0x02;
    case 3:
        return 0x04;
    case 4:
        return 0x08;
    case 5:
        return 0x10;
    case 6:
        return 0x20;
    case 7:
        return 0x40;
    case 8:
        return 0x80;
    default:
        return 0x00;
    }
}

void set_first_8_red_leds(unsigned char byte_data) {
    enable_upper_red_chip;
    P5OUT = byte_data;
    disable_upper_red_chip;
}

void set_first_8_green_leds(unsigned char byte_data) {
    enable_upper_green_chip;
    P5OUT = byte_data;
    disable_upper_green_chip;
}

void set_second_8_red_leds(unsigned char byte_data) {
    enable_lower_red_chip;
    P5OUT = byte_data;
    disable_lower_red_chip;
}

void set_second_8_green_leds(unsigned char byte_data) {
    enable_lower_green_chip;
    P5OUT = byte_data;
    disable_lower_green_chip;
}

void turn_off_all_leds() {
    set_first_8_green_leds(0x00);
    set_first_8_red_leds(0x00);
    set_second_8_green_leds(0x00);
    set_second_8_red_leds(0x00);
}

void delay_for_leds(unsigned char length) {
    while (length--) {
        __delay_cycles(200);
    }
}

void initialize_16_rows_LED() {
    P5DIR |= (BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7); // set Port 5 as output
    P6DIR |= (BIT0 | BIT1 | BIT2 | BIT3);                             // set P6.0-P6.3 as output

    P5OUT &= ~(BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7); // set Port 5 to low
    P6OUT &= ~(BIT0 | BIT1 | BIT2 | BIT3);                             // set P6.0-P6.3 to low

    set_first_8_green_leds(0xff);
    set_second_8_red_leds(0xff);
    millisecond_of_delay(5000);
    turn_off_all_leds();
}

// ****************

// Task 1

// ****************

void task1(row_1, row_2) {
    // the number is between 1 and 16
    //turn_off_all_leds();

    if ((row_1 < 9) && (row_2 < 9)) {
        set_first_8_red_leds(int_to_led_hex(row_1) | int_to_led_hex(row_2));
    } else if ((row_1 > 8) && (row_2 > 8)) {
        set_second_8_red_leds(int_to_led_hex(row_1) | int_to_led_hex(row_2));
    } else if ((row_1 < 9) && (row_2 > 8)) {
        set_first_8_red_leds(int_to_led_hex(row_1));
        set_second_8_red_leds(int_to_led_hex(row_2));
    } else if ((row_1 > 8) && (row_2 < 9)) {
        set_second_8_red_leds(int_to_led_hex(row_1));
        set_first_8_red_leds(int_to_led_hex(row_2));
    }
}

// ****************

// Task 2

// ****************

void task2() {
    int i;
    for (i = 1; i < 17; i++) {
        task1(i + 1, 16 - i);
        millisecond_of_delay(1000);
    }
}

// ****************

// Task 3

// ****************

unsigned char point_square[32] = {
    0x00,
    0x08,
    0x10,
    0x40,
    0x60,
    0x10,
    0x08,
    0x04,
    0x02,
    0x02,
    0x01,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x80,
    0x80,
    0xA0,
    0x9c,
    0x83,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x80,
    0x40,
    0x26,
    0x19,
    0x00,
};

void task3() {
    unsigned char i = 0;
    for (i = 0; i < 16; i++) {
        set_first_8_red_leds(0xff);
        set_second_8_red_leds(0xff);
        delay_for_leds(3);
        set_first_8_green_leds(0x00);
        set_second_8_green_leds(0x00);
        delay_for_leds(2);

        delay_for_leds(3);
        turn_off_all_leds();
        delay_for_leds(3);
    }

    delay_for_leds(44);

    for (i = 0; i < 16; i++) {
        set_first_8_red_leds(0xff);
        set_second_8_red_leds(0xff);
        delay_for_leds(3);
        set_first_8_green_leds(0x00);
        set_second_8_green_leds(0x00);
        delay_for_leds(2);

        delay_for_leds(3);
        turn_off_all_leds();
        delay_for_leds(3);
    }
}

// ****************

// Task 4

// ****************

unsigned char inverse_task4 = 0;
void task4() {
    unsigned char i = 0;
    unsigned char value = 5;

    if (inverse_task4) {
        value = (30 - infrared_detection_counting2) / 5;
    } else {
        value = infrared_detection_counting2 / 5;
    }
    value = infrared_detection_counting2 / 5;
    if (value == 0) {
        if (inverse_task4) {
            inverse_task4 = 0;
        } else {
            inverse_task4 = 1;
        }
    }

    for (i = 0; i < 16; i++) {
        set_first_8_red_leds(0xff);
        set_second_8_red_leds(0xff);
        delay_for_leds(value);
        set_first_8_green_leds(0x00);
        set_second_8_green_leds(0x00);
        delay_for_leds(value);

        delay_for_leds(3);
        turn_off_all_leds();
        delay_for_leds(3);
    }

    delay_for_leds(44);

    for (i = 0; i < 16; i++) {
        set_first_8_red_leds(0xff);
        set_second_8_red_leds(0xff);
        delay_for_leds(value);
        set_first_8_green_leds(0x00);
        set_second_8_green_leds(0x00);
        delay_for_leds(value);

        delay_for_leds(3);
        turn_off_all_leds();
        delay_for_leds(3);
    }
}

// ****************

// Task 5

// ****************

void task5() {
}

// ***************
// ****************
//
// Handle keypad value !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// ***************
// ****************

